In [1]:
import pandas as pd

In [2]:
data = [["harry", 34], ["Jack", 65], ["Shubham", 34]]
data

[['harry', 34], ['Jack', 65], ['Shubham', 34]]

In [3]:
pd.DataFrame(data, columns=["Name", "Marks"])

      Name  Marks
0    harry     34
1     Jack     65
2  Shubham     34

In [4]:
data = {
    "a":[1, 2, 3],
    "b":[4,5,6]
}
data

{'a': [1, 2, 3], 'b': [4, 5, 6]}

In [5]:
df = pd.DataFrame(data)
df.head()

   a  b
0  1  4
1  2  5
2  3  6

In [6]:
import numpy as np

In [7]:
arr = np.array([[1,2], [5,6]])
df = pd.DataFrame(arr, columns=["a", "b"])
df.head()

   a  b
0  1  2
1  5  6

In [8]:
df = pd.read_csv("data.csv")
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [9]:
df[df["BoxOffice(INR Crore)"]>1000]

            Actor     Film  Year      Genre  BoxOffice(INR Crore)  IMDb
0  Shah Rukh Khan  Pathaan  2023     Action                  1050   7.2
2      Aamir Khan   Dangal  2016  Biography                  2024   8.4

In [10]:
df[df["IMDb"]>=9]

Empty DataFrame
Columns: [Actor, Film, Year, Genre, BoxOffice(INR Crore), IMDb]
Index: []

In [11]:
df[df["Genre"]=="Action"]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
7,Hrithik Roshan,War,2019,Action,475,6.5
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [12]:
df = pd.read_json("data.json")
df

    name    language
0  Harry      Python
1   Jack  Javascript

In [13]:
#

In [14]:
df.head() #first 5 rows

    name    language
0  Harry      Python
1   Jack  Javascript

In [15]:
df.tail() #last 5 rows

    name    language
0  Harry      Python
1   Jack  Javascript

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      2 non-null      object
 1   language  2 non-null      object
dtypes: object(2)
memory usage: 164.0+ bytes

In [17]:
df.describe() #Statistical Data

         name language
count       2        2
unique      2        2
top     Harry   Python
freq        1        1

In [18]:
df.columns

Index(['name', 'language'], dtype='object')

In [19]:
df.shape

(2, 2)